app/views/shaving_records/index.html.erb

SELECT "items".* FROM "items" INNER JOIN "shaving_items" ON "items"."id" = "shaving_items"."item_id" WHERE "shaving_items"."shaving_record_id" = $1  [["shaving_record_id", 2]]
---
          <tr>
            <td><% shaving_record.items.each do |item| %>