app/controllers/categories_controller.rb

SELECT "categories".* FROM "categories" WHERE "categories"."user_id" = $1  [["user_id", 1]]
---
  def index
    @categories = Category.where(user_id: current_user.id)

SELECT "items".* FROM "items" WHERE "items"."category_id" = $1  [["category_id", 1]]
---
  def show
    #@category = Category.find(param)
    @items = Item.where(category_id: params[:id])

INSERT INTO "categories" ("name", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Sharps"], ["user_id", 1], ["created_at", "2016-09-20 03:45:05.608825"], ["updated_at", "2016-09-20 03:45:05.608825"]]
---
  def create
    @category = Category.new(category_params)

    respond_to do |format|
      if @category.save

DELETE FROM "categories" WHERE "categories"."id" = $1  [["id", 2]]
---
  def destroy

      respond_to do |format|
        if @category.destroy