app/controllers/expenses_controller.rb

  def index
    @this_month_items = Item.where('extract(month from purchase_date) = ? AND extract(year from purchase_date) = ? AND user_id = ?',
                                     Date.today.month, Date.today.year,  current_user.id)

    @this_month_expense = @this_month_items.sum("price")
---
SELECT "items".* FROM "items" WHERE (extract(month from purchase_date) = 11 AND extract(year from purchase_date) = 2016 AND user_id = 1)
SELECT SUM("items"."price") FROM "items" WHERE (extract(month from purchase_date) = 11 AND extract(year from purchase_date) = 2016 AND user_id = 1)