app/controllers/items_controller.rb

SELECT "categories".* FROM "categories" WHERE "categories"."user_id" = $1  [["user_id", 1]]
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT 1  [["id", 2]]
SELECT "items".* FROM "items" WHERE "items"."category_id" = $1 AND "items"."user_id" = $2  ORDER BY purchase_date asc  [["category_id", 1], ["user_id", 1]]
---
  def index
    #original code
    #@items = Item.where(user_id: current_user.id).order(sort_column + ' ' + sort_direction)
    @categories = Category.where(user_id: current_user.id)

    @items = Item.search(params[:category_id], current_user.id).order(sort_column + ' ' + sort_direction)

SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT 1  [["id", 3]]
---
  def show
    @item = Item.find(params[:id])
    @category = Category.find_by_id(@item.category_id)

SELECT "categories".* FROM "categories" WHERE "categories"."user_id" = $1  [["user_id", 1]]
---
  def new
    @item = Item.new
    @category = Category.where(user_id: current_user.id)

SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT 1  [["id", 2]]
SELECT  "categories".* FROM "categories" WHERE "categories"."user_id" = $1  ORDER BY "categories"."id" ASC LIMIT 1  [["user_id", 1]]
---
  def edit
    @item = Item.find_by_id(params[:id])
    @category = Category.where(user_id: current_user.id)

INSERT INTO "items" ("name", "description", "price", "retired", "equipment_picture_file_name", "equipment_picture_content_type", "equipment_picture_file_size", "equipment_picture_updated_at", "user_id", "purchase_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"
---
  def create
    @item = Item.new(item_params)

    respond_to do |format|
      if @item.save

UPDATE "items" SET "category_id" = $1, "updated_at" = $2 WHERE "items"."id" = $3  [["category_id", 3], ["updated_at", "2016-11-22 07:17:58.328053"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @item.update(item_params)