app/controllers/shaving_records_controller.rb

  def index
    @shaving_records = ShavingRecord.where(user_id: current_user.id).order(sort_column + ' ' + sort_direction)
---
SELECT "shaving_records".* FROM "shaving_records" WHERE "shaving_records"."user_id" = $1  ORDER BY created_at asc  [["user_id", 1]]

  def show
    @shaving_record = ShavingRecord.find(params[:id])
    @shaving_items = ShavingItem.where(shaving_record_id: params[:id]).pluck(:item_id)
    @items = Item.where(id: @shaving_items)
---
SELECT  "shaving_records".* FROM "shaving_records" WHERE "shaving_records"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "shaving_items"."item_id" FROM "shaving_items" WHERE "shaving_items"."shaving_record_id" = $1  [["shaving_record_id", 1]]
SELECT "items".* FROM "items" WHERE "items"."id" IN (1, 3)

  def new
    @shaving_record = ShavingRecord.new
    @item = Item.where(user_id: current_user.id, retired: false)
    @shaving_record.items = @item
    if @item.blank?
---
SELECT "items".* FROM "items" WHERE "items"."user_id" = $1 AND "items"."retired" = $2  [["user_id", 1], ["retired", "f"]]
SELECT "items".* FROM "items"

  def edit
    @shaving_items = ShavingItem.find_by_shaving_record_id(params[:id])
    puts @shaving_items

    @item = Item.where(user_id: current_user.id, retired: false)
---
SELECT  "shaving_items".* FROM "shaving_items" WHERE "shaving_items"."shaving_record_id" = $1 LIMIT 1  [["shaving_record_id", 6]]
SELECT "items".* FROM "items" WHERE "items"."user_id" = $1 AND "items"."retired" = $2  [["user_id", 4], ["retired", "f"]]

  def create
    @shaving_record = ShavingRecord.new(shaving_record_params)
    @shaving_items = params['shave_record'][:item_ids]
    respond_to do |format|
      if @shaving_record.save
        #create loop to add multiple items to shaving items
        @shaving_items.each do |item|
          shaving_item = ShavingItem.new
          #puts 'shaving record', @shaving_record.id
          #puts 'item', item
          @item = Item.find(item)
          shaving_item.shaving_record_id = @shaving_record.id
          shaving_item.item_id = item
          shaving_item.save
          @item.increment!(:uses)
---
INSERT INTO "shaving_records" ("description", "rating", "user_id", "date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["description", "A test"], ["rating", 2], ["user_id", 1], ["date", "2016-09-27 00:00:00.000000"], ["created_at", "2016-09-27 23:12:40.484467"], ["updated_at", "2016-09-27 23:12:40.484467"]]
SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT 1  [["id", 1]]
INSERT INTO "shaving_items" ("shaving_record_id", "item_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["shaving_record_id", 11], ["item_id", 4], ["created_at", "2016-10-05 03:46:04.818364"], ["updated_at", "2016-10-05 03:46:04.818364"]]
UPDATE "items" SET "uses" = $1, "updated_at" = $2 WHERE "items"."id" = $3  [["uses", 1], ["updated_at", "2016-10-24 22:36:09.326572"], ["id", 1]]

  def update

    @shaving_items = params['shave_record'][:item_ids]
    #puts "update" + @shaving_items.to_s
    #@shaving_items_in_record = Hash[ShavingItem.where(shaving_record_id: params[:id]).pluck(:item_id).flatten(1)]
    @shaving_items_in_record = ShavingItem.where(shaving_record_id: params[:id]).pluck(:item_id)
    @shaving_items_in_record = @shaving_items_in_record.map(&:to_s)
    #puts "Old one" + @shaving_items_in_record.to_s

    #@array_math = @shaving_items.zip(@shaving_items_in_record)
    @items_to_add = @shaving_items - @shaving_items_in_record
    #puts "New items" + @array_math.to_s
    @items_to_remove = @shaving_items_in_record - @shaving_items
    #puts "items to remove" +@items_to_remove.to_s


    respond_to do |format|
      if @shaving_record.update(shaving_record_params)

       @items_to_add.each do |new_item|
         shaving_item = ShavingItem.new
         item = Item.find(new_item)
         shaving_item.shaving_record_id = @shaving_record.id
         shaving_item.item_id = new_item
         shaving_item.save
         item.increment!(:uses)
       end

       @items_to_remove.each do |old_item|
         shaving_item_removed = ShavingItem.find_by_shaving_record_id_and_item_id(params[:id], old_item)
         shaving_item_removed.destroy
---
SELECT "shaving_items"."item_id" FROM "shaving_items" WHERE "shaving_items"."shaving_record_id" = $1  [["shaving_record_id", 1]]
SELECT  "shaving_items".* FROM "shaving_items" WHERE "shaving_items"."shaving_record_id" = $1 AND "shaving_items"."item_id" = $2 LIMIT 1  [["shaving_record_id", 1], ["item_id", 1]]
SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT 1  [["id", 2]]
INSERT INTO "shaving_items" ("shaving_record_id", "item_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["shaving_record_id", 1], ["item_id", 2], ["created_at", "2016-11-19 23:44:39.727156"], ["updated_at", "2016-11-19 23:44:39.727156"]]
UPDATE "items" SET "uses" = $1, "updated_at" = $2 WHERE "items"."id" = $3  [["uses", 1], ["updated_at", "2016-11-19 23:44:39.737515"], ["id", 2]]
DELETE FROM "shaving_items" WHERE "shaving_items"."id" = $1  [["id", 1]]

  def destroy
    @shaving_record.destroy
---
DELETE FROM "shaving_records" WHERE "shaving_records"."id" = $1  [["id", 1]]

    def set_shaving_record
      @shaving_record = ShavingRecord.find(params[:id])
---
SELECT  "shaving_records".* FROM "shaving_records" WHERE "shaving_records"."id" = $1 LIMIT 1  [["id", 17]]