app/controllers/users_controller.rb

  def finish_signup
    @user = User.find(params[:id])
    if request.patch? && params[:user]
      if @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 3]]
UPDATE "users" SET "email" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["email", "santiago.peligroso@gmail.com"], ["updated_at", "2016-11-12 03:47:14.304919"], ["id", 3]]